/* eslint-disable max-len */
/* eslint-disable import/prefer-default-export */
export const LANGUAGES = {
  ru: '/',
  ua: '/ua/',
};

export const TRANSLATE = {
  ru: {
    contactFormTitle: 'Ваше уникальное предложение',
    contactFormText: 'Оставьте свои контакты и мы свяжемся с Вами в самое ближайшее время.',
    contactFormAgreement: 'Я согласен с условиями обработки персональных данных.',
    contactsHereToHelp: 'Мы здесь что бы помочь',
    contactsHereToHelpText: `На сегодняшний день сеть филиалов РКЦ насчитывает 9 представительств. Мы обеспечивает логистику из наших складов по всей Украине. Если у Вас остались вопросы, мы с радостью ответим на них!`,
    vacanciesTitle: 'Вакансии',
    citySelect: 'Выберите Ваш город',
    callback: 'Заказать звонок',
    catalog: 'Каталог товаров',
    orderNow: 'Заказать сейчас',
    orderSteps: 'Этапы заказа',
    bannerTitle: 'Наша задача - <br>сделать ремонт простым и качественным',
    bannerText:
      'Ассортимент РКЦ насчитывает всю необходимую  продукцию как для коттеджного и малоэтажного строительства, так и для строительства  крупных промышленных объектов. <br>Мы с радостью поможем в выборе наилучших материалов, именно для Вас.',
    contacts: 'Контакты',
    subscribe: 'Подписывайтесь на нас',
    addpages: 'Дополнительные страницы',
    connectwithus: 'Cвязаться с нами',
    advantagesTitle: 'преимущества работы с нами',
    advantagesText: `РКЦ — ведущий поставщик строительных материалов от наиболее востребованных отечественных и зарубежных производителей.  С 2002 года мы являемся официальным торговым партнером известного бренда Технониколь.`,
    orderStepsTitle: 'этапы заказа',
    orderStepsText: `Мы заботимся о нашем клиенте.<br>Заказывая у нас, Вы получаете максимальное качество продукта и услуг. Каждый заказ для нас важен, потому мы сопровождаем клиента на всех этапах, что является гарантией качества и спокойствия.`,
    searchPlaceholder: 'Искать здесь',
    questionsTitle: 'остались вопросы?',
    questionsText:
      'У вас есть вопросы о наших продуктах, услугах или компании?<br>Здесь вы можете задать вопрос, и специалист ркц ответит вам лично.',
    leaveRequest: 'Оставить заявку',
    mainOffice: 'Главный офис',
    productAbout: 'Все о товаре',
    productScopes: 'Сфери использования',
    productPrice: 'Рекомендованная цена:',
    productPairs: 'Покупают вместе',
    subCategory: 'Подкатегории товаров',
    productRecommended: 'Так же вас могут заинтересовать',
    productBigPrice: 'Цену при большом обьеме заказа уточняйте',
    productGallery: 'Фотогалерея товара',
    productCode: 'Код товара:',
    primaryPage: 'Главная',
    stockPage: 'Акции и скидки',
    sendRequest: 'Отправить заявку',
    selectYourCity: 'Выберите ваш город',
    formPlaceholderName: 'Введите Ваше имя',
    formPlaceholderPhone: 'Введите Ваш номер телефона',
    formPlaceholderEmail: 'Введите Ваш E-mail адрес',
    formPlaceholderPosition: 'Введите должность',
    formAgreement: 'Я согласен с условиями обработки персональных данных.',
    formTitleProposal: 'Ваше предложение по работе',
    formSubtitleProposal: 'Оставьте контакты',
    fillialInCity: 'Филиал в г. ',
    copyrightTitle: '© Copyright - Все права защищены 2020. LOREMIPSUMCOMPANY',
    e404Title: 'Похоже, мы не можем найти нужную вам страницу',
    e404Text: 'Переходите на главную страницу – там Вы сможете найти интересующую Вас информацию.',
    returnToHome: 'Перейти на главную',
    error: 'Ошибка',
    stocksTitle: 'наши акции и скидки',
    stockProducts: 'Акционные товары',
    stocksHeader: 'Все акции',
    buttonDetails: 'Подробнее',
    stockDeadline: 'Акция действует до:',
    happyToHelpTitle: 'мы всегда рады вам помочь!',
    getInfoNow: 'Узнайте прямо сейчас',
    stockWork: 'Акция действует до: ',
    backToStocks: 'Назад ко всем акциям',
    footerUnderLogo: `Lorem, ipsum dolor sit amet consectetur adipisicing elit.
    Explicabo nulla quos doloribus sapiente nisi impedit excepturi neque
    hic reiciendis sed, molestiae unde officia necessitatibus, optio esse maxime at est repudiandae!`,
  },
  ua: {
    contactFormTitle: 'Ваша унікальна пропозиція',
    contactFormText: "Залиште свої контакти і ми зв'яжемося з Вами в самий найближчий час.",
    contactFormAgreement: 'Я згоден з умовами обробки персональних даних.',
    contactsHereToHelp: 'Ми тут щоб допомогти',
    contactsHereToHelpText: `Lorem ipsum, or lipsum as it is sometimes known, 
    is dummy text used in laying out print, graphic or web designs.
    The passage is attributed to an unknown.`,
    vacanciesTitle: 'Вакансії',
    citySelect: 'Оберіть Ваше місто',
    callback: 'Замовити дзвінок',
    catalog: 'Каталог товарів',
    orderNow: 'Замовити зараз',
    orderSteps: 'Етапи замовлення',
    bannerTitle: 'Title UA',
    bannerText: 'Text UA',
    contacts: 'Контакти',
    subscribe: 'Дописуйтесь до нас',
    subCategory: 'Підкатегорії товарів',
    addpages: 'Додаткові сторінки',
    connectwithus: "Зв'язатись з нами",
    advantagesTitle: 'переваги співпраці з нами',
    advantagesText: `UA Lorem ipsum, or lipsum as it is sometimes known, is dummy text used in laying out print, graphic or web designs.
    The passage is attributed to an unknown.`,
    orderStepsTitle: 'кроки замовлення',
    orderStepsText: `Ми дбаємо про нашого клієнта. Замовляючи у нас, Ви отримуєте максимальну якість продукту. Отримання
    всіх послуг на вищому рівні можливо тільки у нас в компанії Ви отримуєте гарантії якості послуг і спокій.`,
    questionsTitle: 'залишились питання?',
    questionsText: 'Тут наші поради',
    leaveRequest: 'Залишити заявку',
    mainOffice: 'Головний офіс',
    primaryPage: 'Головна',
    stockPage: 'Акції та знижки',
    productAbout: 'Все про товаре',
    productScopes: 'Сфери використання',
    productRecommended: 'Також вас можуть зацікавити',
    productPrice: 'Рекомендована ціна:',
    productPairs: 'Купляють разом',
    productBigPrice: "Ціну при великому об'ємі замовлення уточнюйте",
    productCommon: 'Також вас можуть зацікавити',
    productGallery: 'Фотогалерея товару',
    productCode: 'Код товару:',
    sendRequest: 'Надіслати заявку',
    selectYourCity: 'Виберіть ваше місто',
    searchPlaceholder: 'Шукати тут',
    formPlaceholderName: "Введіть Ваше ім'я",
    formPlaceholderPhone: 'Введіть Ваш номер телефону',
    formPlaceholderEmail: 'Введіть Вашу E-mail адресу',
    formPlaceholderPosition: 'Введіть посаду',
    formAgreement: 'Згоден',
    formTitleProposal: 'Ваша пропозиція по роботі',
    formSubtitleProposal: 'Залиште контакти',
    fillialInCity: 'Філія в м. ',
    copyrightTitle: '© Copyright - Усі права захищені 2020. LOREMIPSUMCOMPANY',
    e404Title: 'Схоже, що ми нам не вдалося знайти потрібну вам сторінку',
    e404Text: 'Повертайтесь на головну сторінку – там Ви зможете знайти всю доступну информацию.',
    returnToHome: 'Повернутись до головної',
    error: 'Помилка',
    stocksTitle: 'Наші акції та знижки',
    stockProducts: 'Акційні товари',
    stocksHeader: 'Усі акції',
    buttonDetails: 'Детальніше',
    stockDeadline: 'Акція діє до:',
    happyToHelpTitle: 'ми завжди раді вам допомогти!',
    getInfoNow: 'Дізнайтесь прямо зараз',
    stockWork: 'Акція діє до: ',
    backToStocks: 'Назад до всіх акцій',
    footerUnderLogo: `Lorem, ipsum dolor sit amet consectetur adipisicing elit.
    Explicabo nulla quos doloribus sapiente nisi impedit excepturi neque
    hic reiciendis sed, molestiae unde officia necessitatibus, optio esse maxime at est repudiandae!`,
  },
};

export const ABOUT_OUR_COMPANY = {
  ru: {
    title: 'О нашей компании',
    about: `РКЦ — ведущий поставщик строительных материалов от наиболее востребованных отечественных
    и зарубежных производителей.  С 2002 года мы являемся официальным торговым партнером известного бренда Технониколь.`,
  },
  ua: {
    title: 'Про нашу компанію',
    about: `РКЦ - провідний постачальник будівельних матеріалів від найбільш затребуваних вітчизняних
    і зарубіжних виробників. З 2002 року ми є офіційним торговим партнером відомого бренду Техноніколь.`,
  },
};

export const OUR_BRANCHES = {
  ru: {
    title: 'Наши филиалы',
    about: [
      `На сегодняшний день сеть филиалов РКЦ насчитывает 9 представительств по всей Украине:
    в Днепре, Полтаве, Запорожье, Львове, Харькове, Киеве, Одессе, Хмельницком, Ивано-Франковске.`,
      `Каждый филиал РКЦ имеет собственные склады, обеспечивая тем самым бесперебойные поставки топовых товарных позиций.`,
    ],
  },
  ua: {
    title: 'Наші філії',
    about: [
      `На сьогоднішній день мережа філій РКЦ налічує 9 представництв по всій Україні:
    в Дніпрі, Полтаві, Запоріжжі, Львові, Харкові, Києві, Одесі, Хмельницькому, Івано-Франківську.`,
      `Кожна філія РКЦ має власні склади, забезпечуючи тим самим безперебійне постачання топових товарних позицій.`,
    ],
  },
};

export const GOODS_CATEGORIES = {
  ru: {
    title: 'Категории продуктов',
    about: `Ассортимент РКЦ насчитывает всю необходимую продукцию как для коттеджного и
    малоэтажного строительства, так и для строительства  крупных промышленных объектов.`,
  },
  ua: {
    title: 'Категорії продуктів',
    about: `Асортимент РКЦ налічує всю необхідну продукцію як для котеджного і
    малоповерхового будівництва, так і для будівництва великих промислових об'єктів.`,
  },
};

export const CONTACTS_STEPS = {
  ru: [
    'Заполните форму обратной связи или воспользуйтесь кнопкой обратного звонка либо звоните нам по телефонам.',
    'Наши квалифицированные мастера внимательно выслушают Вашу проблему и предложат оптимальный вариант актуальный именно для Вас!',
    'Специалисты компании приедут со всеми необходимыми материалами и приспособления в оговоренное место для проведения ремонтных работ.',
    `Специалисты нашей компании проведут необходимы монтажные либо ремонтные 
    работы связанные с кровлей вашего помещения и сдадут работу четко в срок.`,
  ],
  ua: [
    "Заповніть форму зворотного зв'язку або скористайтеся кнопкою зворотного дзвінка або телефонуйте нам за телефонами.",
    'Наші кваліфіковані майстри уважно вислухають Вашу проблему і запропонують оптимальний варіант актуальний саме для Вас!',
    'Фахівці компанії приїдуть з усіма необхідними матеріалами та пристосування в обумовлене місце для проведення ремонтних робіт.',
    `Фахівці нашої компанії проведуть необхідні монтажні або ремонтні 
    роботи пов'язані з покрівлею вашого приміщення і здадуть роботу чітко в строк.`,
  ],
};

export const CV_STEPS = {
  ru: [
    'Заполните форму обратной связи или воспользуйтесь кнопкой обратного звонка либо звоните нам по телефонам.',
    `Наши HR-менеджеры свяжуться с вами. Мы уважаем Ваше время и тщательно изучаем каждое резюме.
    И если наша должность соответствует вашему опыту и навыкам, то мы обязательно пригласим Вас на интервью.`,
    'Приглашение на интервью. На собеседовании задают вопросы, касающиеся образования, опыта работы, полученных навыков и знаний.',
    'После собеседования мы свяжемся с Вами и сообщим результаты собеседования!',
  ],
  ua: [
    "Заповніть форму зворотного зв'язку або скористайтеся кнопкою зворотного дзвінка або телефонуйте нам за телефонами.",
    `Наші HR-менеджери зв'яжуться з вами. Ми поважаємо Ваш час і ретельно вивчаємо кожне резюме.
    І якщо наша посаду відповідає вашому досвіду і навичкам, то ми обов'язково запросимо Вас на інтерв'ю.`,
    `Запрошення на інтерв'ю. На співбесіді задають питання, що стосуються освіти, досвіду роботи, отриманих навичок і знань.`,
    `Після співбесіди ми зв'яжемося з Вами і повідомимо результати співбесіди!`,
  ],
};

export const HAPPY_TO_HELP = {
  ru: [
    `Наша основная цель: помочь клиенту решить его задачи наиболее выгодным и технологически
    оправданным способом. Мы предлагаем решения, которые сэкономят ваши расходы, обеспечат быстрое
    выполнение работ и повысят срок службы зданий и фасадов.`,
    `Мы обеспечиваем наивысшее качество строительства с лучшими из доступных на рынке материалов.
    Наша команда ориентирована на долгосрочное сотрудничество и гарантирует выгодные условия партнерства
    для каждого клиента.`,
    `В любой момент вы можете обратиться к нам за консультацией, и наш специалист подберет и
    просчитает необходимые объемы материалов для вашего объекта.`,
    `Наша специализация - комплексный подбор и поставка строительных решений каждому клиенту.`,
    `РКЦ— это ваш надежный партнер для качественного строительства.`,
  ],
  ua: [
    `Наша основная цель: помочь клиенту решить его задачи наиболее выгодным и технологически
    оправданным способом. Мы предлагаем решения, которые сэкономят ваши расходы, обеспечат быстрое
    выполнение работ и повысят срок службы зданий и фасадов.`,
    `Мы обеспечиваем наивысшее качество строительства с лучшими из доступных на рынке материалов.
    Наша команда ориентирована на долгосрочное сотрудничество и гарантирует выгодные условия партнерства
    для каждого клиента.`,
    `В любой момент вы можете обратиться к нам за консультацией, и наш специалист подберет и
    просчитает необходимые объемы материалов для вашего объекта.`,
    `Наша специализация - комплексный подбор и поставка строительных решений каждому клиенту.`,
    `РКЦ— это ваш надежный партнер для качественного строительства.`,
  ],
};
