/* eslint-disable import/prefer-default-export */
export const SEO_ITEMS = {
  ru: {
    aboutPage: {
      description:
        'РКЦ — ведущий поставщик строительных материалов от наиболее востребованных отечественных и зарубежных производителей. С 2002 года мы являемся официальным торговым партнером известного бренда Технониколь.',
      title: 'РКЦ - О нас',
    },
    catalogPage: {
      description:
        'РКЦ — ведущий поставщик строительных материалов от наиболее востребованных отечественных и зарубежных производителей. С 2002 года мы являемся официальным торговым партнером известного бренда Технониколь.',
      title: 'РКЦ - Каталог',
    },
    contactsPage: {
      description:
        'РКЦ — ведущий поставщик строительных материалов от наиболее востребованных отечественных и зарубежных производителей. С 2002 года мы являемся официальным торговым партнером известного бренда Технониколь.',
      title: 'РКЦ - Контакты',
    },
    indexPage: {
      description:
        'РКЦ — ведущий поставщик строительных материалов от наиболее востребованных отечественных и зарубежных производителей. С 2002 года мы являемся официальным торговым партнером известного бренда Технониколь.',
      title: 'РКЦ - Главная',
    },
    stocksPage: {
      description:
        'РКЦ — ведущий поставщик строительных материалов от наиболее востребованных отечественных и зарубежных производителей. С 2002 года мы являемся официальным торговым партнером известного бренда Технониколь.',
      title: 'РКЦ - Акции',
    },
    vacanciesPage: {
      description:
        'РКЦ — ведущий поставщик строительных материалов от наиболее востребованных отечественных и зарубежных производителей. С 2002 года мы являемся официальным торговым партнером известного бренда Технониколь.',
      title: 'РКЦ - Вакансии',
    },
  },
  ua: {
    aboutPage: {
      description:
        'РКЦ - провідний постачальник будівельних матеріалів від найбільш затребуваних вітчизняних і зарубіжних виробників. З 2002 року ми є офіційним торговим партнером відомого бренду Техноніколь.',
      title: 'РКЦ - Про нас',
    },
    catalogPage: {
      description:
        'РКЦ - провідний постачальник будівельних матеріалів від найбільш затребуваних вітчизняних і зарубіжних виробників. З 2002 року ми є офіційним торговим партнером відомого бренду Техноніколь.',
      title: 'РКЦ - Каталог',
    },
    contactsPage: {
      description:
        'РКЦ - провідний постачальник будівельних матеріалів від найбільш затребуваних вітчизняних і зарубіжних виробників. З 2002 року ми є офіційним торговим партнером відомого бренду Техноніколь.',
      title: 'РКЦ - Контакти',
    },
    indexPage: {
      description:
        'РКЦ - провідний постачальник будівельних матеріалів від найбільш затребуваних вітчизняних і зарубіжних виробників. З 2002 року ми є офіційним торговим партнером відомого бренду Техноніколь.',
      title: 'РКЦ - Головна',
    },
    stocksPage: {
      description:
        'РКЦ - провідний постачальник будівельних матеріалів від найбільш затребуваних вітчизняних і зарубіжних виробників. З 2002 року ми є офіційним торговим партнером відомого бренду Техноніколь.',
      title: 'РКЦ - Акції',
    },
    vacanciesPage: {
      description:
        'РКЦ - провідний постачальник будівельних матеріалів від найбільш затребуваних вітчизняних і зарубіжних виробників. З 2002 року ми є офіційним торговим партнером відомого бренду Техноніколь.',
      title: 'РКЦ - Вакансії',
    },
  },
};
