/* eslint-disable import/prefer-default-export */
export const SEO_ITEMS = {
  ru: {
    aboutPage: {
      description: `РКЦ — официальный  представитель Технониколь и ведущий поставщик строительных 
      материалов от наиболее востребованных отечественных и зарубежных производителей.`,
      title: 'РКЦ - О нас',
    },
    catalogPage: {
      description: `РКЦ — официальный  представитель Технониколь и ведущий поставщик строительных 
      материалов от наиболее востребованных отечественных и зарубежных производителей.`,
      title: 'РКЦ - Каталог',
    },
    contactsPage: {
      description: `РКЦ — официальный  представитель Технониколь и ведущий поставщик строительных 
      материалов от наиболее востребованных отечественных и зарубежных производителей.`,
      title: 'РКЦ - Контакты',
    },
    deliveryPage: {
      description: `Описание доставки`,
      title: 'РКЦ - Доставка',
    },
    indexPage: {
      description: `РКЦ — официальный  представитель Технониколь и ведущий поставщик строительных 
      материалов от наиболее востребованных отечественных и зарубежных производителей.`,
      title: 'РКЦ - Главная',
    },
    partnersPage: {
      description: `РКЦ — официальный  представитель Технониколь и ведущий поставщик строительных 
      материалов от наиболее востребованных отечественных и зарубежных производителей.`,
      title: 'РКЦ - Наши партнеры',
    },
    stocksPage: {
      description: `РКЦ — официальный  представитель Технониколь и ведущий поставщик строительных 
      материалов от наиболее востребованных отечественных и зарубежных производителей.`,
      title: 'РКЦ - Акции',
    },
    vacanciesPage: {
      description: `РКЦ — официальный  представитель Технониколь и ведущий поставщик строительных 
      материалов от наиболее востребованных отечественных и зарубежных производителей.`,
      title: 'РКЦ - Вакансии',
    },
  },
  ua: {
    aboutPage: {
      description: `РКЦ - офіційний представник Техноніколь та провідний постачальник будівельних
      матеріалів від найбільш затребуваних вітчизняних та зарубіжних виробників.`,
      title: 'РКЦ - Про нас',
    },
    catalogPage: {
      description: `РКЦ - офіційний представник Техноніколь та провідний постачальник будівельних
      матеріалів від найбільш затребуваних вітчизняних та зарубіжних виробників.`,
      title: 'РКЦ - Каталог',
    },
    contactsPage: {
      description: `РКЦ - офіційний представник Техноніколь та провідний постачальник будівельних
      матеріалів від найбільш затребуваних вітчизняних та зарубіжних виробників.`,
      title: 'РКЦ - Контакти',
    },
    deliveryPage: {
      description: `Опис доставки`,
      title: 'РКЦ - Доставка',
    },
    indexPage: {
      description: `РКЦ - офіційний представник Техноніколь та провідний постачальник будівельних
      матеріалів від найбільш затребуваних вітчизняних та зарубіжних виробників.`,
      title: 'РКЦ - Головна',
    },
    partnersPage: {
      description: `РКЦ - офіційний представник Техноніколь та провідний постачальник будівельних
      матеріалів від найбільш затребуваних вітчизняних та зарубіжних виробників.`,
      title: 'РКЦ - Наші партнери',
    },
    stocksPage: {
      description: `РКЦ - офіційний представник Техноніколь та провідний постачальник будівельних
      матеріалів від найбільш затребуваних вітчизняних та зарубіжних виробників.`,
      title: 'РКЦ - Акції',
    },
    vacanciesPage: {
      description: `РКЦ - офіційний представник Техноніколь та провідний постачальник будівельних
      матеріалів від найбільш затребуваних вітчизняних та зарубіжних виробників.`,
      title: 'РКЦ - Вакансії',
    },
  },
};
